# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'

brew 'librsvg'
brew 'openssl'
brew 'ansible'
brew 'ansible-lint'
brew 'autoconf'
brew 'automake'
brew 'bats'
brew 'bats-core'
brew 'curl'
brew 'cloc'
brew 'cmake'
brew 'coreutils'
brew 'dive'
brew 'mas'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'gnutls'
brew 'highlight'
brew 'http-server'
brew 'lftp'
brew 'mongodb'
brew 'ncurses'
brew 'nano'
brew 'nmap'
brew 'openjdk'
brew 'p7zip'
brew 'poppler'
brew 'pdf2svg'
brew 'shellcheck'
brew 'tree'
brew 'htop'
brew 'vim'
brew 'wget'
brew 'watch'
brew 'jq'
brew 'hub'
brew 'mysql-client'
brew 'proselint'
brew 'grep'

cask 'appcleaner'
cask 'miniconda'
cask 'atom'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'java'
cask 'skype'
cask 'slack'
cask 'mactex'
cask 'meld'
cask 'mendeley'
cask 'robo-3t'
cask 'sourcetree'
cask 'spotify'
cask 'whatsapp'
cask 'adobe-acrobat-reader'
cask 'keepingyouawake'
cask 'sequel-pro'
cask 'tunnelblick'
cask 'zoomus'
cask 'iterm2'

# requires java
brew 'umlet'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

mas 'The Unarchiver', id: 425424353
mas 'Magnet', id: 441258766
